InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/vrgСоответствияМобильныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>vrgСоответствияМобильныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.МаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МобильныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgВозвратМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgРеализацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgВозвратПоставщикуМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgСписаниеМобильное</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgТребованияНакладнаяМобыльный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgОприходованиеМобильное</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgПеремещениеМобильное</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgПриходныйОрдерМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказПоставщикуМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgПоступлениеМобильное</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgРасходныйОрдерМобильный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДО_ПодпискиНаСобытия/Ext/Module.bsl
Процедура ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ТребованиеНакладная") Тогда 
		Если Ложь Тогда Источник = Документы.ТребованиеНакладная.СоздатьДокумент();КонецЕсли;
		Источник.НаправлениеЗатрат = Источник.СтатьяЗатрат.НаправлениеЗатрат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда 
		Если Ложь Тогда Источник = Документы.ОприходованиеТоваров.СоздатьДокумент();КонецЕсли;
		Источник.НаправлениеЗатрат = Источник.СтатьяЗатрат.НаправлениеЗатрат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
		Если Ложь Тогда Источник = Документы.РеализацияТоваровУслуг.СоздатьДокумент();КонецЕсли;
		Источник.ВидДоговора = Источник.ДоговорКонтрагента.ВидДоговора;
	КонецЕсли;
	
	//тодо доп право отв
	Право = Справочники.Константы.НайтиПоНаименованию("ПланыВидовХарактеристик.ПраваПользователей.РедактированиеНеСвоихДокументов").Значение;
	ЕстьПраво = ПолучитьПраво(Право); 
	ЕстьРеквизит = Источник.метаданные().Реквизиты.Найти("Ответственный");
	Если ТипЗнч(Источник) = тип("ДокументОбъект.ЗаявкаНаРасходованиеСредств") Тогда 
	Иначе
		Если Не ЕстьРеквизит = Неопределено И НЕ ЕстьПраво И ЗначениеЗаполнено(Источник.Ссылка.Ответственный) Тогда
			
			////Дандали В. 17.05.2023 
			//Если НЕ Источник.Ссылка.Ответственный = ПараметрыСеанса.ТекущийПользователь Тогда
			//	//Разрешать редактировать если это реализация/заказ из моб.приложения
			//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") 
			//		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ТребованиеНакладная") 
			//		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
			//		
			//		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
			//			Заказ = Источник.Ссылка;
			//		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда
			//			Заказ = Источник.Ссылка.Сделка;
			//		Иначе
			//			Заказ = Источник.Ссылка; 
			//		КонецЕсли;
			//		//
			//		//Если НЕ ЭтоМобильноеПриложение(Заказ) Тогда
			//		//	Сообщить("Користувач не має права редагувати не свої документи!");	
			//		//	Отказ = Истина;
			//		//КонецЕсли;

			//	Иначе
			//		Сообщить("Користувач не має права редагувати не свої документи!");	
			//		Отказ = Истина;
			//	КонецЕсли;
			//КонецЕсли;
			//Дандали В. 17.05.2023 
		КонецЕсли;
	КонецЕсли;
	
	//тодо доп право  бу
	ДопПраво = Справочники.Константы.НайтиПоНаименованию("ПланыВидовХарактеристик.ПраваПользователей.РедактироватьБухУчет").Значение;
	ЕстьПраво = ПолучитьПраво(ДопПраво); 
	ЕстьРеквизит = Источник.метаданные().Реквизиты.Найти("ОтражатьВБухгалтерскомУчете");
	Если Не ЕстьРеквизит = Неопределено И НЕ ЕстьПраво Тогда
		//Если Источник.Ссылка.ОтражатьВБухгалтерскомУчете  ИЛИ  Источник.ОтражатьВБухгалтерскомУчете Тогда  
		//	Сообщить("Користувач не має права редагувати бухгалтерський облік!");	
		//	Отказ = Истина;
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПраво(Право) Экспорт 
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	ЗначенияДопПрав = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	Отбор = ЗначенияДопПрав.Отбор;
	Отбор.Пользователь.Использование = Истина;
	Отбор.Пользователь.Значение =  ТекПользователь;
	Отбор.Право.Использование = Истина;
	Отбор.Право.Значение = Право;
	ЗначенияДопПрав.Прочитать();
	
	Если ЗначенияДопПрав.Количество() > 0 Тогда
		Для каждого Запись ИЗ ЗначенияДопПрав Цикл
			Результат = Запись.Значение;
		КонецЦикла;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоМобильноеПриложение(Заказ)
	
	ЗапросДок = Новый Запрос;
	ЗапросДок.Текст = 
	"ВЫБРАТЬ
	|	vrgСоответствияМобильныхДокументов.МобильныйДокумент.Номер КАК Номер
	|ИЗ
	|	РегистрСведений.vrgСоответствияМобильныхДокументов КАК vrgСоответствияМобильныхДокументов
	|ГДЕ
	|	vrgСоответствияМобильныхДокументов.ОсновнойДокумент = &ОсновнойДокумент";
	
	ЗапросДок.УстановитьПараметр("ОсновнойДокумент", Заказ);
	
	Возврат НЕ ЗапросДок.Выполнить().Пустой();
		
КонецФункции
